In [7]:
import pandas as pd

In [8]:
pd.DataFrame

pandas.core.frame.DataFrame

In [22]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

In [24]:
#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [25]:
df.loc[0]

calories    420
duration     50
Name: 0, dtype: int64

In [26]:
df.loc[[0,2]]

   calories  duration
0       420        50
2       390        45

In [27]:
my_dict = { 
     'name' : ["a", "b", "c", "d", "e","f", "g"],
     'age' : [20,27, 35, 55, 18, 21, 35],
     'designation': ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]
}

In [38]:
df1 = pd.DataFrame(my_dict)

In [39]:
df1.loc[0]

name            a
age            20
designation    VP
Name: 0, dtype: object

In [40]:
df1.loc[[0,2]]

  name  age designation
0    a   20          VP
2    c   35         CFO

In [41]:
df1 = pd.DataFrame(
     my_dict, 
     index=["First", "Second", "Third", 
            "Fourth", "Fifth", "Sixth", 
            "Seventh"]
)
df1

        name  age designation
First      a   20          VP
Second     b   27         CEO
Third      c   35         CFO
Fourth     d   55          VP
Fifth      e   18          VP
Sixth      f   21         CEO
Seventh    g   35          MD

In [45]:
df1.loc[["First","Third"]]

      name  age designation
First    a   20          VP
Third    c   35         CFO

In [47]:
df1.iloc[[4,3,0]]

       name  age designation
Fifth     e   18          VP
Fourth    d   55          VP
First     a   20          VP

In [31]:
df1.head(3) # df.tail()

       name  age designation
First     a   20          VP
Second    b   27         CEO
Third     c   35         CFO

In [32]:
df1.index

Index(['First', 'Second', 'Third', 'Fourth', 'Fifth', 'Sixth', 'Seventh'], dtype='object')

In [33]:
df1.columns

Index(['name', 'age', 'designation'], dtype='object')

In [34]:
df1.set_index("age")

    name designation
age
20     a          VP
27     b         CEO
35     c         CFO
55     d          VP
18     e          VP
21     f         CEO
35     g          MD

In [ ]:
# Delete Column "age"
df1.drop('age',1)

# Delete the Row with Index "3"  
df1.drop(3,0)

# “1” in denotes deletion of the “Column” 
# “0” means deletion of the “Row

In [35]:
my_list = [[1,2,3,4],
           [5,6,7,8],
           [9,10,11,12],
           [13,14,15,16],
           [17,18,19,20]]
df2 = pd.DataFrame(my_list)

In [36]:
df2

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [37]:
df2 * df2

     0    1    2    3
0    1    4    9   16
1   25   36   49   64
2   81  100  121  144
3  169  196  225  256
4  289  324  361  400

In [ ]:
pd.read_